tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76699;

boundaryField
{
    top
    {
        type            calculated;
        value           $internalField;
    }

    ground
    {
        type            calculated;
        value           $internalField;
    }

    sides
    {
        type            calculated;
        value           $internalField;
    }

    burner
    {
        type            calculated;
        value           $internalField;
    }

    "(region0_to.*)"
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
